newwms_gift/src/DataProcessors/ОбработчикНастроекБД/ОбработчикНастроекБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработчикНастроекБД</name>
</mdclass:DataProcessor>

newwms_gift/src/InformationRegisters/итWMSДиапазоныSSCC/итWMSДиапазоныSSCC.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итWMSДиапазоныSSCC</name>
  <resources>
    <name>FSRAR_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиапазонС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиапазонПо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЦифраРасширенияС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифраРасширенияПо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.итФилиалыWMS</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДиапазона</name>
    <type>
      <types>EnumRef.итWMSВидыДиапазонвSSCC</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/DataProcessors/ОбработчикНастроекБД/Forms/ФормаНастроекПолученияSSCC/Module.bsl
&НаКлиенте
Процедура НастройкиДиапазонаФилиалПриИзменении(Элемент)
	Филиал=ТекущийЭлемент.ТекущиеДанные.Филиал;
	Строки=СоответствиеФилиаловИорганизация.НайтиСтроки(новый Структура("Филиал",Филиал));
	Если Строки.Количество()=0 Тогда 
		ТекущийЭлемент.ТекущиеДанные.Филиал=Неопределено;
		итWMSОбщегоНазначенияКлиентСервер.СообщитьПользователю("в начале зополните соответствие филиала и организации, и сохраните изменения");
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Значение=итWMSПривилегированныйМодуль.ПолучитьНастройкиИзХранилищаПоСвойствам("СоответствиеФилиаловИорганизация");
	Если ТипЗнч(Значение)=Тип("Структура") Тогда
		Если Значение.Свойство("СоответствиеФилиаловИорганизация") Тогда 
			СоответствиеФилиаловИорганизация.Загрузить(Значение.СоответствиеФилиаловИорганизация);
		КонецЕсли;
	КонецЕсли;
	ЗагрузитьНастройкиДиапазонов();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиДиапазонов()	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итWMSДиапазоныSSCC.Филиал КАК Филиал,
	|	итWMSДиапазоныSSCC.ВидДиапазона КАК ВидДиапазона,
	|	итWMSДиапазоныSSCC.ДиапазонС КАК ДиапазонС,
	|	итWMSДиапазоныSSCC.ДиапазонПо КАК ДиапазонПо
	|ИЗ
	|	РегистрСведений.итWMSДиапазоныSSCC КАК итWMSДиапазоныSSCC";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	НастройкиДиапазона.Очистить();
	НастройкиДиапазона.Загрузить(РезультатЗапроса);	
	КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	СтруктураХраненияДанных=новый Структура;
	СтруктураХраненияДанных.Вставить("СоответствиеФилиаловИорганизация",СоответствиеФилиаловИорганизация.Выгрузить());
	итWMSПривилегированныйМодуль.СохранитьНастройкиВХранилище(СтруктураХраненияДанных);
КонецПроцедуры


&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаписатьИзмененияНаСервере()
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	Значение=итWMSПривилегированныйМодуль.ПолучитьНастройкиИзХранилищаПоСвойствам("СоответствиеФилиаловИорганизация");
	Если ТипЗнч(Значение)=Тип("Структура") Тогда
		Если не Значение.Свойство("СоответствиеФилиаловИорганизация") Тогда
			итWMSОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных соответсвия");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	НаборЗаписей=РегистрыСведений.итWMSДиапазоныSSCC.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	Для Каждого стр из Значение.СоответствиеФилиаловИорганизация Цикл 
		Строки=НастройкиДиапазона.НайтиСтроки(новый Структура("Филиал",стр.Филиал));
		Для Каждого Строка из Строки Цикл 
			МенеджерЗаписи=РегистрыСведений.итWMSДиапазоныSSCC.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Филиал=Строка.Филиал;
			МенеджерЗаписи.ВидДиапазона=Строка.ВидДиапазона;
			МенеджерЗаписи.FSRAR_ID=стр.Организация.FSRAR_ID;
			МенеджерЗаписи.ДиапазонС=Строка.ДиапазонС;
			МенеджерЗаписи.ДиапазонПо=Строка.ДиапазонПо;
			ПроставитьЦифруРасширения(МенеджерЗаписи);
			МенеджерЗаписи.Записать(Истина);
		КонецЦикла;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	ЗагрузитьНастройкиДиапазонов();
КонецПроцедуры

&НаСервере
Процедура ПроставитьЦифруРасширения(МенеджерЗаписи)
		СтрокаС=Строка(МенеджерЗаписи.ДиапазонС);
		Если СтрДлина(СтрокаС)<9 тогда
			пока СтрДлина(СтрокаС)<9 цикл
				СтрокаС="0"+СтрокаС;
			КонецЦикла;
		КонецЕсли;
		СтрокаПо=Строка(МенеджерЗаписи.ДиапазонПо);
		Если СтрДлина(СтрокаПо)<9  тогда
			Пока  СтрДлина(СтрокаПо)<9 цикл
				СтрокаПо="0"+СтрокаПо;
			КонецЦикла;
		КонецЕсли;
		 МенеджерЗаписи.ЦифраРасширенияС=Число(Лев(СтрокаС,1));
		 МенеджерЗаписи.ЦифраРасширенияПо=Число(Лев(СтрокаПо,1));
	КонецПроцедуры
&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	ЗаписатьИзмененияНаСервере();
КонецПроцедуры
